# Напишите процедуру, которая выводит на экран
# запись переданного ей числа в римской системе счисления.
# Числа находятся в диапазоне [1, 3999]
# I - 1, V - 5, X - 10, L - 50, C  - 100, D - 500, M - 1000
# Пример:
# 2013
# MMXIII
def number_to_rome(a):
    rofl = ["I", "V", "X", "L", "C", "D", "M"]
    if (a // 10) > 99:
        n = a // 1000
        print(rofl[6]*n)
    if
a = int(input())
number_to_rome(a)
